СРО_Копия/src/Reports/СРО_ОтчетПоРазделамДокументовОтчетности/СРО_ОтчетПоРазделамДокументовОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СРО_ОтчетПоРазделамДокументовОтчетности</name>
</mdclass:Report>

СРО_Копия/src/Catalogs/Разделы/Разделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Разделы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Раздел1</name>
      <description>Раздел 1</description>
    </items>
    <items>
      <name>Раздел10</name>
      <description>Раздел 10</description>
    </items>
    <items>
      <name>Раздел11</name>
      <description>Раздел 11</description>
    </items>
    <items>
      <name>Раздел12</name>
      <description>Раздел 12</description>
    </items>
    <items>
      <name>Раздел13</name>
      <description>Раздел 13</description>
    </items>
    <items>
      <name>Раздел2</name>
      <description>Раздел 2</description>
        </content>
          </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
        </content>
      </content>
          </content>
          </content>
        </content>
          </content>
          </content>
        </content>
          </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел3</name>
      <description>Раздел 3</description>
      </content>
        </content>
      </content>
        </content>
      </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел4</name>
      <description>Раздел 4</description>
      </content>
      </content>
      </content>
        </content>
      </content>
      </content>
      </content>
        </content>
        </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
          </content>
          </content>
          </content>
        </content>
      </content>
      </content>
        </content>
        </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел5</name>
      <description>Раздел 5</description>
      </content>
    </items>
    <items>
      <name>Раздел6</name>
      <description>Раздел 6</description>
      </content>
        </content>
        </content>
        </content>
        </content>
        </content>
      </content>
    </items>
    <items>
      <name>Раздел7</name>
      <description>Раздел 7</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел8</name>
      <description>Раздел 8</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>Раздел9</name>
      <description>Раздел 9</description>
      </content>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРаздела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СРО_Копия/src/Reports/СРО_ОтчетПоРазделамДокументовОтчетности/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере(ТабличныйДокумент, КраткийРеестр) 	
	
	ЭтотОбъект.РезультатРазделы.Очистить();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", КонецДня(ПериодОтчета.ДатаОкончания));    	
	СтруктураПараметров.Вставить("флФильтрыПоАктивам", флФильтрыПоАктивам);
	СтруктураПараметров.Вставить("АктивыОт", АктивыОт); 	
	СтруктураПараметров.Вставить("АктивыДо", АктивыДо); 	
	СтруктураПараметров.Вставить("флФильтрПоКоличествуЧленов", флФильтрПоКоличествуЧленов);
	СтруктураПараметров.Вставить("КоличествоЧленовОт", КоличествоЧленовОт);    
	СтруктураПараметров.Вставить("КоличествоЧленовДо", КоличествоЧленовДо);     	
	СтруктураПараметров.Вставить("флФильтрПоКоличествуРегионов", флФильтрПоКоличествуРегионов);
	СтруктураПараметров.Вставить("КоличествоРегионовДляОтбора", КоличествоРегионовДляОтбора);    	
	СтруктураПараметров.Вставить("флВыводитьРеестр", флВыводитьРеестр);      	
	СтруктураПараметров.Вставить("флВыводитьСопроводительноеПисьмо", флВыводитьСопроводительноеПисьмо);     
	
	СтруктураПараметров.Вставить("МассивКПК", СписокКПК.ВыгрузитьЗначения());  
	СтруктураПараметров.Вставить("СписокРазделов", СписокРазделов.Скопировать());  

	СтруктураПараметров.Вставить("ВсеРазделы", ВсеРазделы);  
	
	СтруктураПараметров.Вставить("ТабличныйДокумент", ТабличныйДокумент);   
	СтруктураПараметров.Вставить("КраткийРеестр", КраткийРеестр);         
	
	МассивТабличныхДокументов = Отчеты.СРО_ОтчетПоРазделамДокументовОтчетности.СформироватьТабличныеДокументы(СтруктураПараметров); 	
	ТекТабличныйДокумент = МассивТабличныхДокументов[0];
	
	ЭтотОбъект.РезультатРазделы.Вывести(ТекТабличныйДокумент);	 
	
КонецПроцедуры



&НаКлиенте
Процедура Сформировать(Команда) 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	КраткийРеестр = Новый ТабличныйДокумент;

	СформироватьНаСервере(ТабличныйДокумент, КраткийРеестр);
	
	Если флВыводитьРеестр Тогда
		КраткийРеестр.Показать("Краткий реестр КПК");
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция ПолучитьКПКДокумента(ВыбДокумент)
	//Если ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.ОтчетностьКПК") 
	//	ИЛИ ТипЗнч(ВыбДокумент) = Тип("ДокументОбъект.ОтчетностьКПК") Тогда
	//	Возврат ВыбДокумент.КПК;
	//Иначе
	//	Возврат Неопределено;		
	//КонецЕсли;
	
КонецФункции


&НаСервере

Процедура ЗаполнитьСписокРазделовНаСервере()
	СписокРазделов.Добавить(Справочники.Разделы.Раздел1);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел4);    
	СписокРазделов.Добавить(Справочники.Разделы.Раздел9);
	СписокРазделов.Добавить(Справочники.Разделы.Раздел10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СписокРазделов.Количество() = 0 Тогда  
		ЗаполнитьСписокРазделовНаСервере();		
	КонецЕсли;	
	
	ОбновитьДоступностьРеквизитов();
	
	КоличествоРегионовДляОтбора = 2;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьРеквизитов()
	
	Элементы.АктивыОт.Доступность = флФильтрыПоАктивам;
	Элементы.АктивыДо.Доступность = флФильтрыПоАктивам;
	
	Элементы.КоличествоЧленовОт.Доступность = флФильтрПоКоличествуЧленов;
	Элементы.КоличествоЧленовДо.Доступность = флФильтрПоКоличествуЧленов;
	
	Элементы.КоличествоРегионовДляОтбора.Доступность = флФильтрПоКоличествуРегионов;
	
	Элементы.СписокРазделов.Доступность = НЕ ВсеРазделы;     	
	Элементы.флВыводитьСопроводительноеПисьмо.Доступность = НЕ ВсеРазделы;

КонецПроцедуры


&НаКлиенте
Процедура флФильтрыПоАктивамПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры


&НаКлиенте
Процедура флФильтрПоКоличествуЧленовПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();    
КонецПроцедуры


&НаКлиенте
Процедура флФильтрПоКоличествуРегионовПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов(); 
КонецПроцедуры


&НаКлиенте
Процедура ВсеРазделыПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
	
КонецПроцедуры
